
{
    "GrayScaleColors": {
        "whiteAlpha00": "Absolute transparency of white. Used for invisible elements with potential for fade-in effects.",
        "whiteAlpha01": "Slight opacity of white. Useful for subtle white overlays or highlights.",
        "whiteAlpha05": "5% opacity of white. Subtle highlights or faint overlays.",
        "whiteAlpha10": "10% opacity of white. Mild highlights.",
        "whiteAlpha15": "15% opacity of white. Used for faint backgrounds.",
        "whiteAlpha20": "20% opacity of white.",
        "whiteAlpha30": "30% opacity of white.",
        "whiteAlpha40": "40% opacity of white.",
        "whiteAlpha50": "50% opacity of white. Medium intensity white for balanced overlays.",
        "whiteAlpha60": "60% opacity of white.",
        "whiteAlpha70": "70% opacity of white.",
        "whiteAlpha80": "80% opacity of white.",
        "whiteAlpha90": "90% opacity of white. Strong white for prominent elements.",
        "whiteAlpha95": "95% opacity of white.",
        "whiteAlpha97": "97% opacity of white. Almost solid white, with a hint of transparency.",
        "whiteAlpha100": "Pure white. Suitable for primary backgrounds and text.",
        "blackAlpha00": "Absolute transparency of black. Used for invisible elements with fade-in effects potential.",
        "blackAlpha01": "Near transparent black. Useful for subtle black overlays.",
        "blackAlpha05": "5% opacity of black. Subtle shadows or overlays.",
        "blackAlpha10": "10% opacity of black. Mild shadows.",
        "blackAlpha15": "15% opacity of black.",
        "blackAlpha20": "20% opacity of black.",
        "blackAlpha30": "30% opacity of black.",
        "blackAlpha40": "40% opacity of black.",
        "blackAlpha50": "50% opacity of black. Balanced opacity for medium emphasis elements.",
        "blackAlpha60": "60% opacity of black.",
        "blackAlpha70": "70% opacity of black.",
        "blackAlpha80": "80% opacity of black.",
        "blackAlpha90": "90% opacity of black. Strong opacity for emphasized elements.",
        "blackAlpha95": "95% opacity of black.",
        "blackAlpha97": "97% opacity of black. Almost solid black with a hint of transparency.",
        "blackAlpha100": "Pure black. Ideal for primary text or deep shadows.",
        "transparent": "Fully transparent. Used when elements should have no visible color.",
        "primaryTextColor": "Primary color for textual content.",
        "text": "General color for text.",
        "secondaryTextColor": "Secondary or subdued text color.",
        "mediumTextColor": "Mid-tone text color, often used for subheadings or secondary information.",
        "inverseOnSurface": "Contrast color for text or icons displayed on top of surfaces.",
        "inverseSurface": "Background color contrasting with the main surface color.",
        "inversePrimary": "Inverse of the primary color, suitable for contrast applications."
    },
    "ElementColors": {
        "dividerColor": "Color for dividers and separators in the UI.",
        "primaryContainer": "Main background color for primary containers or segments.",
        "secondaryContainer": "Background color for secondary or less emphasized UI containers.",
        "tertiary": "Third-level color, often used for tertiary buttons or elements.",
        "tertiaryContainer": "Background color for tertiary containers or less emphasized sections.",
        "outline": "Color for outlines or borders around interactive elements.",
        "shadow": "Shadow color for UI elements, providing depth or emphasis.",
        "secondaryButtonBackgroundColor": "Background color for secondary action buttons.",
        "secondaryIconTextColor": "Color for icons or text that are secondary in emphasis.",
        "primaryIconTextColor": "Color for primary icons or symbols."
    },
    "BrandColors": {
        "colorOne": "Primary brand color, representing the main brand identity.",
        "colorTwo": "Secondary brand color, complementing the primary.",
        "colorThree": "Tertiary brand color, often used for accents or variations.",
        "colorFour": "Quaternary brand color, further complementing the brand palette.",
        "colorFive": "Quinary brand color, often used for subtle brand elements or backgrounds.",
        "primary": "Main brand color used for primary branding elements.",
        "primaryLighter": "Lightened version of the primary brand color.",
        "secondary": "Secondary brand color, used for secondary brand elements or to complement the primary.",
        "accent": "Distinctive color used for accents or emphasis in line with brand guidelines.",
        "accentLighter": "Lighter shade of the brand accent color.",
        "accent50": "50% opacity of the brand accent color.",
        "accent80": "80% opacity of the brand accent color.",
        "primaryIconColor": "Icon color aligned with the primary brand color.",
        "secondaryIconColor": "Icon color aligned with the secondary brand color."
    },
    "BackgroundColors": {
        "backdrop": "Background color typically used behind modals or dialogs.",
        "background": "Default background color of the app or website.",
        "headerBackground": "Background color specifically for headers or top navigation.",
        "cardBackgroundColor": "Background color for cards or boxed content.",
        "commentBackgroundColor": "Background for user comments or input areas.",
        "tabBarColor": "Color for the bottom tab bars or navigation elements.",
        "surface": "Background color for raised elements or surfaces.",
        "surfaceVariant": "Variant of the main surface color, used for differentiation.",
        "webWashColor": "Soft color wash used typically for web page backgrounds."
    },
    "FeedbackColors": {
        "error": "Color signifying errors or issues.",
        "successColor": "Color indicating success or a positive state.",
        "warningAlpha22": "22% opacity warning color for mild alerts.",
        "warningAlpha62": "62% opacity warning color for more prominent alerts.",
        "errorContainer": "Background color for error messages or containers.",
        "onError": "Text or icon color to be used on error-colored backgrounds.",
        "onErrorContainer": "Contrasting text or icon color for error containers."
    },
    "InteractionColors": {
        "placeholder": "Subdued color for placeholder text in form fields.",
        "selectedColorOne10": "10% opacity of a color used for selected or active elements.",
        "selectedColorOne40": "40% opacity of a color used for selected or active elements.",
        "selectedColorOne100": "Solid color used for selected or active elements.",
        "accentDarkest": "Darkest shade of the accent color.",
        "primaryDarkest": "Darkest shade of the primary interaction color.",
        "reference": "Color used for references or to point out related content.",
        "onPrimary": "Text or icon color to be used on primary-colored backgrounds.",
        "onPrimaryContainer": "Contrasting color for text or icons on primary containers.",
        "onSecondary": "Text or icon color for use on secondary-colored backgrounds.",
        "hyperLinkColor": "Color specifically for hyperlinks or clickable text.",
        "onSecondaryContainer": "Text or icon color to be used on secondary-colored containers.",
        "onSurface": "Text or icon color to be used on main surface color.",
        "onSurfaceVariant": "Text or icon color to be used on the variant surface color.",
        "onSurfaceDisabled": "Subdued text or icon color indicating disabled state on surfaces.",
        "onBackground": "Text or icon color to be used on the main background color."
    }
}
